Revit 2027 API
Segment.AddSize Method
 Adds a new MEPSize to the segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddSize(
	MEPSize size
)
Public Sub AddSize (
	size As MEPSize
)
public:
void AddSize(
	MEPSize^ size
)
member AddSize :
        size : MEPSize -> unit
Parameters
size MEPSize
 The new MEPSize to be added.
Exceptions
Exception | Condition
ArgumentException |  There is already a same size in the settings. -or- The size already exists in the segment.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Segment Class
Autodesk.Revit.DB Namespace